// ИНСТРУКЦИИ

// Инструкция выполняет действия, а выражение возвращает значение

// Иструкции обычно заканчивается точкой с запятой
// Исключение: Точка с запятой не требуется после блока инструкций

// Примеры
let a;

const b = 5;
if (a > b) {
    console.log('a is larger');
}

for (let i = 0; i < 5; i++) {
    console.log(i);
}


// Выражения могут быть инструкциями
// 'abc';
// a = a + 3;
// c = a + b;
// d = 'Good ' + 'Evening';
// myFunction(c, d);
// console.log('Hey');

// Как отличить выражение от инструкции
// Выражения могут быть использованы как аргументы в вызовах функций
